import pickle
import pprint
def save_raw_words_dict():
    words_dictionary={
        # 政治
        # {
        '国内政治': ['党', '书记', '市委', '反腐', '党委', '常委', '共产党', '政府', '人大', '习近平', '李克强', '共产党', '十九大', '宪法', '意识形态', '换届',
                 '中共', '全会', '十九届', '政治局', '政治', '新时代', '全国政协' ],
        '主权': ['钓鱼岛', '西藏', '新疆', '黄岩岛', '洞朗'],
        '台湾问题': ['台湾', '当局', '大陆', '九二共识', '台独', '对岸', '对台军售', '蔡英文', '一个中国', '李登辉', '民进党', '国民党', '陈水扁', '台商', '两岸'],
        '香港': ['香港', '港独', '占中'],
        '人权': ['人权', '刘晓波', '言论自由', '自由'],
        '西藏问题': ['达赖喇嘛', '藏传佛教', '藏独', '班禅', '达赖', '西藏'],
        '朝鲜': ['核武器', '朝核', '板门店', '金正恩', '朝鲜', '韩国', '朝韩', '朝方', '韩方', '团聚'],
        # }

        # 军事
        # {
        '军事': ['攻击', '袭击', '军事', '领空', '领海', '导弹', '海军', '核潜艇', '核', '空军', '空域', '演习', '攻击', '战略', '军火'],
        '安全': ['警方', '击毙', '歼灭', '匪徒', '军火', '嫌犯', '拦截', '犯罪', '犯罪行为', '打击', '贩毒'],
        # }

        # 经济
        # {
        '经济': ['外汇', '建设', '增长', '不良贷款', '贷款', '外汇储备', '浮动', 'GDP', '经济', '商业', '金融', '人民币', '货币', '市场', '销售量', '生产总值',
               '达沃斯'],
        '股市': ['股市', '成交量', '下跌', '上涨', '攀高', '领涨', '成交额', '上升股', '市场', '银监会', '证监会'],
        # }

        # 社会民生
        # {
        '农业': [],
        '民生': ['物价', '居民', '价格', '经销商', '食品安全', '销售量', '住房', '就业', '二孩', '二胎', '春运', '五险一金', '低保', '社保'],
        '教育': ['教师', '减负', '学区房', '双一流', '导师', '教授', '清北', '学生', '学者', '教育部', '长江学者', '高校'],
        '宗教': ['基督教', '清真', '伊斯兰'],
        '交通': ['客车', '追尾', '驾驶', '高速公路', '交通', '公路', '交警', '交通警察', '交警支队', '高铁', '动车', '班次', '春运', '运输', '抢票'],
        '环境': ['环境', '绿水青山', '金山银山', '蓝天保卫战', '雾霾', '污染', '尾气'],
        '法律': ['宪法', '修宪', '法律', '法案', '法院', '修订', '律师', '司法', '法院', '法官', '维权', '涉案'],
        '医疗': ['医疗', '流感', '医学', '医保', '疗程', '医学', '医生', '疾病', '诊所', '看病难', '看病贵', '医患关系', '报销', '挂号']
        # }
    }
    output = open('dict.pkl', 'wb')
    pickle.dump(words_dictionary, output)
    output.close()

def read_from_dict():
    pkl_file = open('dict.pkl', 'rb')
    words_dictionary = pickle.load(pkl_file)
    # print(type(words_dictionary))
    # pprint.pprint(words_dictionary)
    return words_dictionary

def save_words_dict(words_dictionary):
    output = open('dict.pkl', 'wb')
    pickle.dump(words_dictionary, output)
    output.close()

save_raw_words_dict()
